Revit 2027 API
EnergyDataSettings.GetEnergyDataSettings Method
 Gets the energy data settings element in the document.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static EnergyDataSettings GetEnergyDataSettings(
	Document doc
)
Public Shared Function GetEnergyDataSettings (
	doc As Document
) As EnergyDataSettings
public:
static EnergyDataSettings^ GetEnergyDataSettings(
	Document^ doc
)
static member GetEnergyDataSettings :
        doc : Document -> EnergyDataSettings
Parameters
doc Document
 The document where the settings element is found.
Return Value
EnergyDataSettings
 The element which stores the energy data settings for the document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace